In [2]:
## Using Pandas ##
import numpy as np
import pandas as pd

In [53]:
# Creating Series #
# from a python list
labels = ['a','b','c','d']
my_list = [9,8,7,6]

In [54]:
pd.Series(data=my_list)

0    9
1    8
2    7
3    6
dtype: int64

In [55]:
pd.Series(data=my_list, index=labels)

a    9
b    8
c    7
d    6
dtype: int64

In [56]:
pd.Series(my_list,labels)

a    9
b    8
c    7
d    6
dtype: int64

In [57]:
# from a numpy array
arr = np.array([100,200,300,400,500])
pd.Series(arr)

0    100
1    200
2    300
3    400
4    500
dtype: int32

In [58]:
labels1=['a','b','c','d','e']
pd.Series(arr,labels1)

a    100
b    200
c    300
d    400
e    500
dtype: int32

In [63]:
# from a dictionary
d = {'x':80,'y':85}
pd.Series(d)

x    80
y    85
dtype: int64

In [64]:
# Creating a DataFrame #
# From lists
a = [i for i in range (12,16)]
b = [i for i in range (17,21)]
c = [i for i in range (22,26)]

In [65]:
pd.DataFrame(data=[a,b,c],
             index= 'a b c'.split(),
             columns= 'w x y z'.split())

    w   x   y   z
a  12  13  14  15
b  17  18  19  20
c  22  23  24  25

In [66]:
pd.DataFrame(data=list(zip(a,b,c)),
             index= 'w x y z'.split(),
             columns= 'a b c'.split())

    a   b   c
w  12  17  22
x  13  18  23
y  14  19  24
z  15  20  25

In [67]:
# from a list
my_list=[[1,2,3,4,5,6,7,8,9,10],
         [11,12,13,14,15,16,17,18,19,20]]
pd.DataFrame(my_list,
             index= 'b1 b2'.split(),
             columns= 'c1 c2 c3 c4 c5 c6 c7 c8 c9 c10'.split())

    c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
b1   1   2   3   4   5   6   7   8   9   10
b2  11  12  13  14  15  16  17  18  19   20

In [68]:
## di transpose
pd.DataFrame(my_list,
             index= 'b1 b2'.split(),
             columns= 'c1 c2 c3 c4 c5 c6 c7 c8 c9 c10'.split()).T

     b1  b2
c1    1  11
c2    2  12
c3    3  13
c4    4  14
c5    5  15
c6    6  16
c7    7  17
c8    8  18
c9    9  19
c10  10  20

In [15]:
# from an array
from numpy.random import randn
np.random.seed(10)

In [69]:
df = pd.DataFrame(randn(4,3),index='B1 B2 B3 B4'.split(),columns='C1 C2 C3'.split())
df

          C1        C2        C3
B1 -1.977728 -1.743372  0.266070
B2  2.384967  1.123691  1.672622
B3  0.099149  1.397996 -0.271248
B4  0.613204 -0.267317 -0.549309

In [70]:
# from a dictionary
my_d={'c1':[10,20,30],
      'c2':[40,50,60],
      'c3':[70,80,90]}
pd.DataFrame(my_d, index='b1 b2 b3'.split())

    c1  c2  c3
b1  10  40  70
b2  20  50  80
b3  30  60  90

In [87]:
## Data Frame Manipulation ##
# add new row #
df.loc['new_baris']=[0.1,0.2,0.3]
df

                 C1        C2        C3
B1        -1.977728 -1.743372  0.266070
B2         2.384967  1.123691  1.672622
B3         0.099149  1.397996 -0.271248
B4         0.613204 -0.267317 -0.549309
new_baris  0.100000  0.200000  0.300000

In [88]:
# add new column #
df['TOTAL'] = df['C1'] + df['C2'] + df['C3']
df

                 C1        C2        C3     TOTAL
B1        -1.977728 -1.743372  0.266070 -3.455030
B2         2.384967  1.123691  1.672622  5.181281
B3         0.099149  1.397996 -0.271248  1.225898
B4         0.613204 -0.267317 -0.549309 -0.203422
new_baris  0.100000  0.200000  0.300000  0.600000

In [89]:
# insert new column #
df.insert(3,'NEW',[1,2,3,4,5])
df

                 C1        C2        C3  NEW     TOTAL
B1        -1.977728 -1.743372  0.266070    1 -3.455030
B2         2.384967  1.123691  1.672622    2  5.181281
B3         0.099149  1.397996 -0.271248    3  1.225898
B4         0.613204 -0.267317 -0.549309    4 -0.203422
new_baris  0.100000  0.200000  0.300000    5  0.600000

In [90]:
# Removing columns without inplace
df.drop(['TOTAL','NEW'],axis=1)

                 C1        C2        C3
B1        -1.977728 -1.743372  0.266070
B2         2.384967  1.123691  1.672622
B3         0.099149  1.397996 -0.271248
B4         0.613204 -0.267317 -0.549309
new_baris  0.100000  0.200000  0.300000

In [91]:
df

                 C1        C2        C3  NEW     TOTAL
B1        -1.977728 -1.743372  0.266070    1 -3.455030
B2         2.384967  1.123691  1.672622    2  5.181281
B3         0.099149  1.397996 -0.271248    3  1.225898
B4         0.613204 -0.267317 -0.549309    4 -0.203422
new_baris  0.100000  0.200000  0.300000    5  0.600000

In [92]:
# Removing columns with inplace
df.drop(['TOTAL','NEW'],axis=1,inplace=True)

In [93]:
df

                 C1        C2        C3
B1        -1.977728 -1.743372  0.266070
B2         2.384967  1.123691  1.672622
B3         0.099149  1.397996 -0.271248
B4         0.613204 -0.267317 -0.549309
new_baris  0.100000  0.200000  0.300000

In [94]:
# Removing rows
df.drop('new_baris',axis=0)

          C1        C2        C3
B1 -1.977728 -1.743372  0.266070
B2  2.384967  1.123691  1.672622
B3  0.099149  1.397996 -0.271248
B4  0.613204 -0.267317 -0.549309

In [95]:
df.reset_index()

       index        C1        C2        C3
0         B1 -1.977728 -1.743372  0.266070
1         B2  2.384967  1.123691  1.672622
2         B3  0.099149  1.397996 -0.271248
3         B4  0.613204 -0.267317 -0.549309
4  new_baris  0.100000  0.200000  0.300000

In [96]:
new_index = 'JKT SUB BDO MLG DPS'.split()
new_index

['JKT', 'SUB', 'BDO', 'MLG', 'DPS']

In [97]:
df['Kota'] = new_index
df

                 C1        C2        C3 Kota
B1        -1.977728 -1.743372  0.266070  JKT
B2         2.384967  1.123691  1.672622  SUB
B3         0.099149  1.397996 -0.271248  BDO
B4         0.613204 -0.267317 -0.549309  MLG
new_baris  0.100000  0.200000  0.300000  DPS

In [98]:
df.set_index('Kota')

            C1        C2        C3
Kota
JKT  -1.977728 -1.743372  0.266070
SUB   2.384967  1.123691  1.672622
BDO   0.099149  1.397996 -0.271248
MLG   0.613204 -0.267317 -0.549309
DPS   0.100000  0.200000  0.300000

In [99]:
df

                 C1        C2        C3 Kota
B1        -1.977728 -1.743372  0.266070  JKT
B2         2.384967  1.123691  1.672622  SUB
B3         0.099149  1.397996 -0.271248  BDO
B4         0.613204 -0.267317 -0.549309  MLG
new_baris  0.100000  0.200000  0.300000  DPS

In [100]:
df['Kota'] = new_index
df.set_index('Kota', inplace=True)

In [101]:
df

            C1        C2        C3
Kota
JKT  -1.977728 -1.743372  0.266070
SUB   2.384967  1.123691  1.672622
BDO   0.099149  1.397996 -0.271248
MLG   0.613204 -0.267317 -0.549309
DPS   0.100000  0.200000  0.300000